wellfrogliu/labview-stm32/RealView/EK-LM3S8962 USB/Template/Drivers/CAN/src/RTX_CAN.c
/*--------------------------- Rd --------------------------------------------
 *
 *  Read CAN register with software delay to workaround hardware problem    
 *
 *  Parameter:  reg_adr:    Address of CAN register
 *
 *  Return:     U32:        Read register value
 *---------------------------------------------------------------------------*/

static U32 Rd (U32 reg_adr)
{
  U32 i;
  U32 ret_val;
  U32 int_reenable;
  U32 int_msk;

  switch (reg_adr & 0xFFFFF000) {     /* Get CAN controller interrupt mask   */
    case CAN0_BASE:
      int_msk = (1 << (INT_CAN0 - 48));
      break;
    case CAN1_BASE:
      int_msk = (1 << (INT_CAN1 - 48));
      break;
    default:
      int_msk = (1 << (INT_CAN0 - 48));
      break;
  }

  /* Remember interrupt enable state                                         */
  int_reenable = HWREG(NVIC_EN1) & int_msk;

  /* Disable current CAN controller interrupt if enabled                     */
  if (int_reenable)
    HWREG (NVIC_DIS1) = int_msk;

  HWREG (reg_adr);                    /* Dummy read                          */

  for(i = 0; i < clk_ratio; i++);     /* Wait for at least SYSclk/CANclk     */

  ret_val = HWREG (reg_adr);          /* Real register read value            */

  /* Reenable current CAN controller interrupt if it was enabled before      */
  if (int_reenable)
    HWREG (NVIC_EN1) = int_msk;

  return (ret_val);                   /* Return read register value          */
}

/*--------------------------- Wr --------------------------------------------
 *
 *  Write CAN register with software delay to workaround hardware problem    
 *
 *  Parameter:  reg_adr:    Address of CAN register
 *              val:        Value to be written
 *
 *  Return:     none
 *---------------------------------------------------------------------------*/

static void Wr (U32 reg_adr, U32 val)
{
  U32 i;

  HWREG (reg_adr) = val;              /* Write value                         */

  for(i = 0; i < clk_ratio; i++);     /* Wait for at least SYSclk/CANclk     */
}

/*--------------------------- CAN_get_ctrl ----------------------------------
 *
 *  Get address and return it in parameter of function, of controller which 
 *  index is passed as parameter
 *
 *  Parameter:  ctrl:       Index of CAN controller
 *              ptr_can:    Address of CAN controller in memory map (returned)
 *
 *  Return:     CAN_ERROR:  Error code
 *---------------------------------------------------------------------------*/

static CAN_ERROR CAN_get_ctrl (U32 ctrl, U32 *ptr_can) {

  switch (ctrl) {
    case 1: 
      *ptr_can = CAN0_BASE;
      break;
    case 2: 
      *ptr_can = CAN1_BASE;
      break;
    case 3: 
    default:
      return CAN_UNEXIST_CTRL_ERROR;
  }

  return CAN_OK;
}

/*--------------------------- CAN_set_baudrate ------------------------------
 *
 *  Setup the requested baudrate
 *
 *  Parameter:  ctrl:       Index of CAN controller
 *              baudrate:   Baudrate
 *
 *  Return:     CAN_ERROR:  Error code
 *---------------------------------------------------------------------------*/

static CAN_ERROR CAN_hw_set_baudrate (U32 ctrl, U32 baudrate)  {
  U32 CANx;
  U32 brp = CAN_CLOCK;                /* CAN module clock                    */

  CAN_get_ctrl(ctrl, &CANx);          /* Get address of CAN controller       */

  /* Determine which nominal time to use for requested baudrate and set
     appropriate bit timing                                                  */
  if (baudrate <= 500000)  {
    brp  = (brp / 16) / baudrate;
                                                                          
    /* Load the baudrate registers CANBIT and CANBRPE registers
       so that sample point is at about 70% bit time from bit start          */
    /* TSEG1 = 11, TSEG2 = 4, SJW = 4 => 1 CAN bit = 16 TQ, sample at 75%    */
    Wr(CANx + CAN_O_BIT , (3 << 12) | (10 << 8) | (3 << 6) | ((brp-1) & 0x3F));
    Wr(CANx + CAN_O_BRPE, (((brp-1) >> 6) & 0x0F));
  }  else if (baudrate <= 1000000)  {
    brp  = (brp / 8 ) / baudrate;

    /* Load the baudrate registers CANBIT and CANBRPE registers
       so that sample point is at about 70% bit time from bit start          */
    /* TSEG1 = 4, TSEG2 = 3, SJW = 3 => 1 CAN bit = 8 TQ, sample at 62.5%    */
    Wr(CANx + CAN_O_BIT , (2 << 12) | (3 << 8) | (2 << 6) | ((brp-1) & 0x3F));
    Wr(CANx + CAN_O_BRPE, (((brp-1) >> 6) & 0x0F));
  }  else  {
    return CAN_BAUDRATE_ERROR;
  }  

  return CAN_OK;
}


/*************************** Module Functions ********************************/

/*--------------------------- CAN_hw_loopback -------------------------------
 *
 *  Setup CAN controller in loopback mode
 *
 *  Parameter:  ctrl:       Index of CAN controller
 *
 *  Return:     CAN_ERROR:  Error code
 *---------------------------------------------------------------------------*/

CAN_ERROR CAN_hw_loopback (U32 ctrl)  {
  U32 CANx;

  CAN_get_ctrl(ctrl, &CANx);          /* Get address of CAN controller       */

  /* Enable Test mode                                                        */
  Wr(CANx + CAN_O_CTL, Rd(CANx + CAN_O_CTL) | CAN_CTL_TEST);

  /* Activate Loopback                                                       */
  Wr(CANx + CAN_O_TST, Rd(CANx + CAN_O_TST) | CAN_TST_LBACK /*| CAN_TST_SILENT*/);

  return CAN_OK;
}

/*--------------------------- CAN_hw_setup ----------------------------------
 *
 *  Setup CAN transmit and receive PINs and interrupt vectors
 *
 *  Parameter:  ctrl:       Index of CAN controller
 *
 *  Return:     CAN_ERROR:  Error code
 *---------------------------------------------------------------------------*/

CAN_ERROR CAN_hw_setup (U32 ctrl)  {
  switch (ctrl) {
    case 1: 
      #if USE_CAN_CTRL1 == 1
        SysCtlPeripheralEnable(SYSCTL_PERIPH_CAN0);         /* Enable CAN clk*/
        SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOD);        /* Enable PIO clk*/
        GPIOPinTypeCAN(GPIO_PORTD_BASE, (1<<0) | (1<<1));   /* Setup pins    */

