wellfrogliu/labview-stm32/RealView/EK-LM3S8962 USB/Template/Drivers/CAN/src/RTX_CAN.c
        /* Set priority and enable interrupt                                 */
        HWREG(NVIC_PRI9)  |= (0xFEUL << 24);
        HWREG(NVIC_EN1)   |= 1 << (INT_CAN0 - 48);
      #endif
      break;
    case 2: 
      #if USE_CAN_CTRL2 == 1
        SysCtlPeripheralEnable(SYSCTL_PERIPH_CAN1);         /* Enable CAN clk*/
        SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOF);        /* Enable PIO clk*/
        GPIOPinTypeCAN(GPIO_PORTF_BASE, (1<<0) | (1<<1));   /* Setup pins    */

        /* Set priority and enable interrupt                                 */
        HWREG(NVIC_PRI10) |= (0xFDUL << 0);
        HWREG(NVIC_EN1)   |= 1 << (INT_CAN1 - 48);
      #endif
      break;
    case 3: 
      #if USE_CAN_CTRL3 == 1
        return CAN_UNEXIST_CTRL_ERROR;
      #endif
      break;
    default:
      return CAN_UNEXIST_CTRL_ERROR;
  }

  return CAN_OK;
}

/*--------------------------- CAN_hw_init -----------------------------------
 *
 *  Initialize the CAN hardware
 *
 *  Parameter:  ctrl:       Index of CAN controller
 *              baudrate:   Baudrate
 *
 *  Return:     CAN_ERROR:  Error code
 *---------------------------------------------------------------------------*/

CAN_ERROR CAN_hw_init (U32 ctrl, U32 baudrate)  {
  U32 i;
  U32 CANx;

  CAN_get_ctrl(ctrl, &CANx);          /* Get address of CAN controller       */

  /* Calculate SYS clk / CAN clk ratio used for software delay because of 
     hardware chip problems                                                  */
  clk_ratio = (U32)((SysCtlClockGet() / CAN_CLOCK) + 1);

  /* Enter init mode, disable automatic retransmission                       */
  Wr(CANx + CAN_O_CTL, CAN_CTL_CCE | CAN_CTL_DAR | CAN_CTL_INIT);

  if (CAN_hw_set_baudrate(ctrl, baudrate) != CAN_OK)    /* Set baudrate      */
    return CAN_BAUDRATE_ERROR;

  /* Initialize all objects as unused                                        */
  while (Rd(CANx + CAN_O_IF1CRQ) & CAN_IFCRQ_BUSY);     /* Wait while busy   */
  Wr(CANx + CAN_O_IF1CMSK, CAN_IFCMSK_WRNRD | CAN_IFCMSK_ARB | CAN_IFCMSK_CONTROL);
  Wr(CANx + CAN_O_IF1ARB2, 0);
  Wr(CANx + CAN_O_IF1MCTL, 0);
  for (i = 0; i < 32; i++) {
    while (Rd(CANx + CAN_O_IF1CRQ) & CAN_IFCRQ_BUSY);   /* Wait while busy   */
    Wr(CANx + CAN_O_IF1CRQ, i);
  }
  while (Rd(CANx + CAN_O_IF1CRQ) & CAN_IFCRQ_BUSY);     /* Wait while busy   */
  Wr(CANx + CAN_O_IF1CMSK, CAN_IFCMSK_NEWDAT | CAN_IFCMSK_CLRINTPND);
  for (i = 0; i < 32; i++) {
    while (Rd(CANx + CAN_O_IF1CRQ) & CAN_IFCRQ_BUSY);   /* Wait while busy   */
    Wr(CANx + CAN_O_IF1CRQ, i);
  }
  Rd(CANx + CAN_O_STS);               /* Acknowledge pending interrupts      */
  
  /* Set the clocking to run from PLL at 50 MHz                              */
  SysCtlClockSet(SYSCTL_SYSDIV_4 | SYSCTL_USE_PLL | SYSCTL_OSC_MAIN | SYSCTL_XTAL_8MHZ);
  
  return CAN_OK;
}

/*--------------------------- CAN_hw_start ----------------------------------
 *
 *  Enable the CAN interrupts
 *
 *  Parameter:  ctrl:       Index of CAN controller
 *
 *  Return:     CAN_ERROR:  Error code
 *---------------------------------------------------------------------------*/

CAN_ERROR CAN_hw_start (U32 ctrl)  {
  U32 CANx;

  CAN_get_ctrl(ctrl, &CANx);          /* Get address of CAN controller       */

  /* Enable interrrupt, exit init mode, disable automatic retransmission     */
  Wr(CANx + CAN_O_CTL, CAN_CTL_DAR | CAN_CTL_IE);

  return CAN_OK;
}

/*--------------------------- CAN_hw_tx_empty -------------------------------
 *
 *  Check if interface register group 0 (IF1) is available for usage
 *
 *  Parameter:  ctrl:       Index of CAN controller
 *
 *  Return:     CAN_ERROR:  Error code
 *---------------------------------------------------------------------------*/

CAN_ERROR CAN_hw_tx_empty (U32 ctrl)  {
  U32 CANx;

  CAN_get_ctrl(ctrl, &CANx);            /* Get address ofo CAN controller     */

  if ((os_sem_wait (wr_sem[ctrl-1], 0) != OS_R_TMO)){ /* If semaphore is free*/
  if (!(Rd(CANx + CAN_O_IF1CRQ) & CAN_IFCRQ_BUSY))    /* Interface 0 is free */
                                                      /* for transmission    */
    return CAN_OK;
    else 
      os_sem_send(wr_sem[ctrl-1]);    /* Return a token back to semaphore    */
  }

  return CAN_TX_BUSY_ERROR;
}

/*--------------------------- CAN_hw_wr -------------------------------------
 *
 *  Write CAN_msg to the hardware registers of the requested controller
 *
 *  Parameter:  ctrl:       Index of CAN controller
 *              msg:        Pointer to CAN message to be written to hardware
 *
 *  Return:     CAN_ERROR:  Error code
 *---------------------------------------------------------------------------*/

CAN_ERROR CAN_hw_wr (U32 ctrl, CAN_msg *msg)  {
  U32 CANx;

  CAN_get_ctrl(ctrl, &CANx);            /* Get address of CAN controller     */

  /* Set flags for informations that will be changed                         */
  Wr(CANx + CAN_O_IF1CMSK,   CAN_IFCMSK_WRNRD   | 
                             CAN_IFCMSK_ARB     | 
                             CAN_IFCMSK_CONTROL |
                             CAN_IFCMSK_DATAA   |
                             CAN_IFCMSK_DATAB);

  /* Setup the identifier information                                        */
  if (msg->format == STANDARD_FORMAT)  {  /* Standard ID                     */
    Wr(CANx + CAN_O_IF1ARB1, 0);
    Wr(CANx + CAN_O_IF1ARB2, (U16) (msg->id << 2));
  }  else  {                              /* Extended ID                     */
    Wr(CANx + CAN_O_IF1ARB1, (U16) (msg->id));
    Wr(CANx + CAN_O_IF1ARB2, (U16)((msg->id) >> 16) | CAN_IFARB2_XTD);
  }

  /* Setup type information                                                  */
  if (msg->type == DATA_FRAME)  {         /* DATA FRAME                      */
    Wr(CANx + CAN_O_IF1ARB2, Rd(CANx + CAN_O_IF1ARB2) | CAN_IFARB2_DIR);
  }

  /* Setup data bytes                                                        */
  Wr(CANx + CAN_O_IF1DA1, ((U16) msg->data[1]<<8) | msg->data[0]);
  Wr(CANx + CAN_O_IF1DA2, ((U16) msg->data[3]<<8) | msg->data[2]);
  Wr(CANx + CAN_O_IF1DB1, ((U16) msg->data[5]<<8) | msg->data[4]);
  Wr(CANx + CAN_O_IF1DB2, ((U16) msg->data[7]<<8) | msg->data[6]);

  /* Setup length and message control bits                                   */
  Wr(CANx + CAN_O_IF1MCTL, CAN_IFMCTL_NEWDAT | 
                           CAN_IFMCTL_TXIE   |
                           CAN_IFMCTL_TXRQST |
                           CAN_IFMCTL_EOB    |
                           (msg->len & 0x000F));

