wellfrogliu/labview-stm32/RealView/EK-LM3S8962 USB/Template/Drivers/CAN/src/RTX_CAN.c
      Wr(CANc + CAN_O_IF2CMSK, CAN_IFCMSK_CLRINTPND);   /* Release rx object */
      Wr(CANc + CAN_O_IF2CRQ,  ch);
    }
  }
}

#endif


#if USE_CAN_CTRL2 == 1

/*--------------------------- CAN1_IRQHandler -------------------------------
 *
 *  CAN interrupt function 
 *  If transmit interrupt occured and there are messages in mailbox for 
 *  transmit it writes it to hardware and starts the transmission
 *  If receive interrupt occured it reads message from hardware registers 
 *  and puts it into receive mailbox
 *---------------------------------------------------------------------------*/

#undef  CTRL0
#define CTRL0                 1
#undef  CTRL
#define CTRL                  2
#undef  CANc
#define CANc                  CAN1_BASE

void CAN1_IRQHandler (void) __irq  {
  U32 ch, status;
  CAN_msg *ptrmsg;

  ch = Rd(CANc + CAN_O_INT);          /* Index of object that caused         */
                                      /* interrupt                           */
  status = Rd(CANc + CAN_O_STS);      /* Read status register                */

  if ((ch-1)<32)  {                   /* Check if index in range 1 - 32      */

    /* Wait until Interface Register 2 becomes free                          */
    while (Rd(CANc + CAN_O_IF2CRQ) & CAN_IFCRQ_BUSY);

    if (status & CAN_STS_TXOK)  {                       /* Tx interrupt      */
      /* Clear Tx Ok flag                                                    */
      Wr(CANc + CAN_O_STS, Rd(CANc + CAN_O_STS) & ~CAN_STS_TXOK);

      Wr(CANc + CAN_O_IF2CMSK, CAN_IFCMSK_CLRINTPND);   /* Release tx object */
      Wr(CANc + CAN_O_IF2CRQ , ch);

      /* Wait until Interface Register 2 becomes free                        */
      while (Rd(CANc + CAN_O_IF2CRQ) & CAN_IFCRQ_BUSY);

        /* If there is a message in the mailbox ready for send, read the 
           message from the mailbox and send it                              */
        if (isr_mbx_receive (MBX_tx_ctrl[CTRL0], (void **)&ptrmsg) != OS_R_OK) {
          /* Wait until Interface Register 1 becomes free                    */
          while (Rd(CANc + CAN_O_IF1CRQ) & CAN_IFCRQ_BUSY);

          CAN_hw_wr (CTRL, ptrmsg);
          _free_box(CAN_mpool, ptrmsg);
      } else {
        isr_sem_send(wr_sem[CTRL0]);  /* Return a token back to semaphore    */
      }
    }  else {                                           /* Rx interrupt      */
                                      /* It should have been checked like
                                         "if (status & CAN_STS_RXOK)"
                                         but isn't because in TEST mode RxOk 
                                         flag in Status Register isn't 
                                         activated upon reception of message */
      /* Clear Rx Ok flag                                                    */
      Wr(CANc + CAN_O_STS, Rd(CANc + CAN_O_STS) & ~CAN_STS_RXOK);

      /* If the mailbox isn't full read the message from the hardware and
         send it to the message queue                                        */
      if (isr_mbx_check (MBX_rx_ctrl[CTRL0]) > 0)  {
        /* Wait until Interface Register 2 becomes free                      */
        while (Rd(CANc + CAN_O_IF2CRQ) & CAN_IFCRQ_BUSY);

        ptrmsg = _alloc_box (CAN_mpool);
        CAN_hw_rd (CTRL, ch, ptrmsg); /* Read and release received message   */
        isr_mbx_send (MBX_rx_ctrl[CTRL0], ptrmsg);
      }

      Wr(CANc + CAN_O_IF2CMSK, CAN_IFCMSK_CLRINTPND);   /* Release rx object */
      Wr(CANc + CAN_O_IF2CRQ,  ch);
    }
  }
}

#endif


#if USE_CAN_CTRL3 == 1

/*--------------------------- CAN2_IRQHandler -------------------------------
 *
 *  CAN interrupt function 
 *  If transmit interrupt occured and there are messages in mailbox for 
 *  transmit it writes it to hardware and starts the transmission
 *  If receive interrupt occured it reads message from hardware registers 
 *  and puts it into receive mailbox
 *---------------------------------------------------------------------------*/

#undef  CTRL0
#define CTRL0                 2
#undef  CTRL
#define CTRL                  3
#undef  CANc
#define CANc                  CAN2_BASE

void CAN2_IRQHandler (void) __irq  {
  U32 ch, status;
  CAN_msg *ptrmsg;

  ch = Rd(CANc + CAN_O_INT);          /* Index of object that caused         */
                                      /* interrupt                           */
  status = Rd(CANc + CAN_O_STS);      /* Read status register                */

  if ((ch-1)<32)  {                   /* Check if index in range 1 - 32      */

    /* Wait until Interface Register 2 becomes free                          */
    while (Rd(CANc + CAN_O_IF2CRQ) & CAN_IFCRQ_BUSY);

    if (status & CAN_STS_TXOK)  {                       /* Tx interrupt      */
      /* Clear Tx Ok flag                                                    */
      Wr(CANc + CAN_O_STS, Rd(CANc + CAN_O_STS) & ~CAN_STS_TXOK);

      Wr(CANc + CAN_O_IF2CMSK, CAN_IFCMSK_CLRINTPND);   /* Release tx object */
      Wr(CANc + CAN_O_IF2CRQ , ch);

      /* Wait until Interface Register 2 becomes free                        */
      while (Rd(CANc + CAN_O_IF2CRQ) & CAN_IFCRQ_BUSY);

        /* If there is a message in the mailbox ready for send, read the 
           message from the mailbox and send it                              */
        if (isr_mbx_receive (MBX_tx_ctrl[CTRL0], (void **)&ptrmsg) != OS_R_OK) {
          /* Wait until Interface Register 1 becomes free                    */
          while (Rd(CANc + CAN_O_IF1CRQ) & CAN_IFCRQ_BUSY);

          CAN_hw_wr (CTRL, ptrmsg);
          _free_box(CAN_mpool, ptrmsg);
      } else {
        isr_sem_send(wr_sem[CTRL0]);  /* Return a token back to semaphore    */
      }
    }  else {                                           /* Rx interrupt      */
                                      /* It should have been checked like
                                         "if (status & CAN_STS_RXOK)"
                                         but isn't because in TEST mode RxOk 
                                         flag in Status Register isn't 
                                         activated upon reception of message */
      /* Clear Rx Ok flag                                                    */
      Wr(CANc + CAN_O_STS, Rd(CANc + CAN_O_STS) & ~CAN_STS_RXOK);

      /* If the mailbox isn't full read the message from the hardware and
         send it to the message queue                                        */
      if (isr_mbx_check (MBX_rx_ctrl[CTRL0]) > 0)  {
        /* Wait until Interface Register 2 becomes free                      */
        while (Rd(CANc + CAN_O_IF2CRQ) & CAN_IFCRQ_BUSY);

        ptrmsg = _alloc_box (CAN_mpool);
        CAN_hw_rd (CTRL, ch, ptrmsg); /* Read and release received message   */
        isr_mbx_send (MBX_rx_ctrl[CTRL0], ptrmsg);
      }

      Wr(CANc + CAN_O_IF2CMSK, CAN_IFCMSK_CLRINTPND);   /* Release rx object */
      Wr(CANc + CAN_O_IF2CRQ,  ch);
    }
  }
}

#endif


/*----------------------------------------------------------------------------
 * end of file
 *---------------------------------------------------------------------------*/

